/**--------------File Info---------------------------------------------------------------------------------
** File name:               uart3.h
** Descriptions:            The USART2 application function
**
**--------------------------------------------------------------------------------------------------------
** Created by:              feiji
** Created date:            20131109
** Version:                 v1.0
** Descriptions:            The original version
**
//硬件连接：Uart(PA2 PA3)通过扩展模块引出，使用平行串口线连接到PC机。
//打开串口调试助手，9600 8 N 1,不要勾选十六进制发送与接收
//先输出一些提示信息，以后发什么，回什么。

**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/

#ifndef _UART3_H
#define _UART3_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include <stdio.h>

#define USART3_BaudRate	 9600

/* Private function prototypes -----------------------------------------------*/
void USART3_Configuration(void);

void USART3_Putc(unsigned char c);
/**************************************************************
 ** 函数名 :USART3_Puts
 ** 功能   :将USART2_Puts（）内容打印到串口
 ** 输入   :无
 ** 输出   :无
 ** 返回   :无
 ** 注意   :无
***************************************************************/
void USART3_Puts(char * str);  
/*********************************************************************************************************
      END FILE
*********************************************************************************************************/
#endif

