/**--------------File Info---------------------------------------------------------------------------------
** File name:               uart2.h
** Descriptions:            The USART2 application function
**
**--------------------------------------------------------------------------------------------------------
** Created by:              feiji
** Created date:            20130930
** Version:                 v1.0
** Descriptions:            The original version
**
//硬件连接：Uart(PA2 PA3)通过扩展模块引出，使用平行串口线连接到PC机。
//打开串口调试助手，9600 8 N 1,不要勾选十六进制发送与接收
//先输出一些提示信息，以后发什么，回什么。

**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/

#ifndef _UART2_H
#define _UART2_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include <stdio.h>

#define USART2_BaudRate	 9600

#define MAX485_Enable_H		GPIO_SetBits(GPIOC , GPIO_Pin_4)
#define MAX485_Enable_L		GPIO_ResetBits(GPIOC , GPIO_Pin_4)


/* Private function prototypes -----------------------------------------------*/
void USART2_Configuration(void);

/***********************************************************
函数原型：void MAX485ENABLE_Configuration(void)
函数功能：485使能引脚控制
入口参数：
出口参数：
备    注：PC4
***********************************************************/
void MAX485ENABLE_Configuration(void);

void USART2_Putc(unsigned char c);
/**************************************************************
 ** 函数名 :USART2_Puts
 ** 功能   :将USART2_Puts（）内容打印到串口
 ** 输入   :无
 ** 输出   :无
 ** 返回   :无
 ** 注意   :无
***************************************************************/
void USART2_Puts(char * str);  
/*********************************************************************************************************
      END FILE
*********************************************************************************************************/
#endif

